src/DataProcessors/устПриемкаТСДНовая.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>устПриемкаТСДНовая</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Режим</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрашиватьКоличество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпонентаKeyBoardHook</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыВыбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>Штрихкоды объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновнойШтрихкод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Запрет</Name>
					<Comment>Действия с этим объектом запрещены</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Короб</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Comment>Штрихкод</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект, которому принадлежит штрихкод (номенклатура, карточка, документ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения, для которой установлен штрихкод</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры, для которой установлен штрихкод</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/устПриемкаТСДНовая/Forms/Аутентификация/Ext/Form/Module.bsl
&НаКлиенте
Процедура Загрузить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Выйти(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура плвВведенноеЗначениеПриИзменении(Элемент)
	
	ВведенноеЗначение = СокрЛП(ВведенноеЗначение);
	
	Если ПустаяСтрока(ВведенноеЗначение) Тогда
	ПодключитьОбработчикОжидания("УстановитьПозициюНаШтрихкод", 0.01, Истина);		
		Возврат;
	КонецЕсли;
	
	Статус = УстановитьОператора(ВведенноеЗначение);
	
	ПодключитьОбработчикОжидания("УстановитьПозициюНаШтрихкод", 0.01, Истина);		

	Если Статус = 0 Тогда Возврат; КОнецЕсли;
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Режим", Объект.Режим);
	ПараметрыОткрытияФормы.Вставить("Оператор", Объект.Оператор);
	
	ОткрытьФорму("Обработка.устПриемкаТСДНовая.Форма.Начало1",ПараметрыОткрытияФормы);
	ЗакрытьФорму = Истина;
	Закрыть("ОК");
	
КонецПроцедуры

&НаСервере
Функция УстановитьОператора(ВведенноеЗначение)
	
	Карточка = ВернутьКарточкуОператора(ВведенноеЗначение);
	
	Если Карточка.Пустая() Тогда
		Сообщить("Оператор не идентифицирован - " + ВведенноеЗначение);
		ВведенноеЗначение = "";
		Возврат 0;	
	КонецЕсли;	
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	
	ТекОбъект.Оператор = Карточка.Объект;
	
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");

	Возврат 1;
КонецФункции

&НаКлиенте
Процедура УстановитьПозициюНаШтрихкод()
	
	ЭтотОбъект.ТекущийЭлемент = Элементы.ВведенноеЗначение;
	
КонецПроцедуры

&НаСервере
Функция ВернутьКарточкуОператора(ШК)
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Штрихкоды.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод = &Штрихкод
	|	И Штрихкоды.Объект ССЫЛКА Справочник.Карточки");
	Запрос.УстановитьПараметр("Штрихкод",ШК);
	ВыборкаКарточек = Запрос.Выполнить().Выбрать();
	Если ВыборкаКарточек.Следующий() Тогда
		Возврат ВыборкаКарточек.Объект;
	Иначе
		Возврат Справочники.Карточки.ПустаяСсылка();
	КонецЕсли;	
КонецФункции	

&НаКлиенте       
Процедура ВыйтиНажатие(Элемент)
	
	ЗакрытьФорму = Истина;
	Закрыть("ОК");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеОтображения()
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы = Ложь И (НЕ ЗакрытьФорму) Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры
